microchip-pic-avr-examples/dspic33a-curiosity-oob/dspic33ak128mc106_dim/dspic33ak128mc106_dim.X/mcc_generated_files/system/src/clock.c
/**
 * CLOCK Generated Driver Source File 
 * 
 * @file      clock.c
 *            
 * @ingroup   clockdriver
 *            
 * @brief     This is the generated source file for CLOCK driver
 *            
 * @version   Driver Version 1.0.1
 *            
 * @skipline  Device : dsPIC33CH128MP508
*/

/*
© [2022] Microchip Technology Inc. and its subsidiaries.

    Subject to your compliance with these terms, you may use Microchip 
    software and any derivatives exclusively with Microchip products. 
    You are responsible for complying with 3rd party license terms  
    applicable to your use of 3rd party software (including open source  
    software) that may accompany Microchip software. SOFTWARE IS ?AS IS.? 
    NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS 
    SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT,  
    MERCHANTABILITY, OR FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT 
    WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
    INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY 
    KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF 
    MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE 
    FORESEEABLE. TO THE FULLEST EXTENT ALLOWED BY LAW, MICROCHIP?S 
    TOTAL LIABILITY ON ALL CLAIMS RELATED TO THE SOFTWARE WILL NOT 
    EXCEED AMOUNT OF FEES, IF ANY, YOU PAID DIRECTLY TO MICROCHIP FOR 
    THIS SOFTWARE.
*/

// Section: Includes
#include <xc.h>
#include <stdint.h>
#include "../clock.h"
#include "../../clock_settings.h"

//to be removed in template
void CLOCK_Initialize(void)
{
    OSCCFGbits.POSCMD = POSCMD_XT_MODE;
    
 /**   PLL1DIV |= (PLLDIV_POSTDIV1_2|PLLDIV_PLLFBDIV(50)|PLLDIV_RFDIV(1)|PLLDIV_POSTDIV2_1);
    PLL1CON |= (PLLCON_ON_1|PLLCON_OE_1|PLLCON_NOSC_POSC);
    
            
    //Enable PLL Input and Feedback Divider update
    PLL1CONbits.PLLSWEN = 1;
    while (PLL1CONbits.PLLSWEN == 1);
    PLL1CONbits.FOUTSWEN = 1;
    while (PLL1CONbits.FOUTSWEN);
    PLL1CONbits.OSWEN = 1; //enable clock switching
    while (PLL1CONbits.OSWEN); //wait for switching(hardware clear)
    while(!OSCCTRLbits.PLL1RDY); //wait for clock to be ready
**/
    
    CLK1CON = (CLKCON_ON_1|CLKCON_OE_1|CLKCON_BOSC_BFRC|CLKCON_FSCMEN_1|CLKCON_NOSC_FRC);
    CLK1DIV = (CLKDIV_FRACDIV_2_P1x(0)|CLKDIV_INTDIV_2x(1));
        
    CLK1CONbits.DIVSWEN = 1; //enable divide factors to get updated
    while (CLK1CONbits.DIVSWEN); //hardware cleared 

    CLK1CONbits.OSWEN = 1; //enable clock switching
    while (CLK1CONbits.OSWEN); //wait for switching(hardware clear))

    //IFS0bits.CLKFAILIF = 0; // enable clock failure interrupt
    //IEC0bits.CLKFAILIE = 1;
    
    //Generator3 clock switch
    CLK3CON = (CLKCON_ON_1|CLKCON_OE_1|CLKCON_BOSC_BFRC|CLKCON_FSCMEN_1|CLKCON_NOSC_BFRC);
    //CLK1DIV = (CLKDIV_FRACDIV_2_P1x(0)|CLKDIV_INTDIV_2x(1));
        
    CLK3CONbits.DIVSWEN = 1; //enable divide factors to get updated
    while (CLK3CONbits.DIVSWEN); //hardware cleared 

    CLK3CONbits.OSWEN = 1; //enable clock switching
    while (CLK3CONbits.OSWEN); //wait for switching(hardware clear))
    
    //Generator8 clock switch
    CLK8CON = (CLKCON_ON_1|CLKCON_OE_1|CLKCON_BOSC_BFRC|CLKCON_FSCMEN_1|CLKCON_NOSC_FRC);
    //CLK12DIV = (CLKDIV_FRACDIV_2_P1x(0)|CLKDIV_INTDIV_2x(1));
        
    CLK8CONbits.DIVSWEN = 1; //enable divide factors to get updated
    while (CLK8CONbits.DIVSWEN); //hardware cleared 

    CLK8CONbits.OSWEN = 1; //enable clock switching
    while (CLK8CONbits.OSWEN); //wait for switching(hardware clear))

//    IFS0bits.CLKFAILIF = 0; // enable clock failure interrupt
//    IEC0bits.CLKFAILIE = 1;

    
    //Clock diagnostics control register, clock monitor and fault injection bits
    //CLKDIAG = 0x0; This reg is not present in compiler yet
    
    //FRC tuner
    FRCOSCTUN = 0x0; 
    
    //BFRC tuning
    BFRCOSCTUN =0x0; 
    
    //Clock Monitor control register
    CM1CON = 0x0;
    CM2CON = 0x0;
    CM3CON = 0x0;
    CM4CON = 0x0;
    
    //Clock monitor status register
    CM1STAT = 0x0;
    CM2STAT = 0x0;
    CM3STAT = 0x0;
    CM4STAT = 0x0;
    
    //Clock monitor prescalar
    CM1WINPR = 0x0;
    CM2WINPR = 0x0;
    CM3WINPR = 0x0;
    CM4WINPR = 0x0;
    
    //Clock monitor Input selection register
    CM1SEL = 0x0;
    CM2SEL = 0x0;
    CM3SEL = 0x0;
    CM4SEL = 0x0;
    
    //Clock monitor last fetched count buffer
    CM1BUF = 0x0;
    CM2BUF = 0x0;
    CM3BUF = 0x0;
    CM4BUF = 0x0;
    
    //Clock monitor saturation value
    CM1SAT = 0x0;
    CM2SAT = 0x0;
    CM3SAT = 0x0;
    CM4SAT = 0x0;
    
    //Clock monitor high value fail
    CM1HFAIL = 0x0;
    CM2HFAIL = 0x0;
    CM3HFAIL = 0x0;
    CM4HFAIL = 0x0;
    
    //Clock monitor low value fail
    CM1LFAIL = 0x0;
    CM2LFAIL = 0x0;
    CM3LFAIL = 0x0;
    CM4LFAIL = 0x0;
    
    //Clock monitor high warning
    CM1HWARN = 0x0;
    CM2HWARN = 0x0;
    CM3HWARN = 0x0;
    CM4HWARN = 0x0;

    //Clock monitor low warning
    CM1LWARN = 0x0;
    CM2LWARN = 0x0;
    CM3LWARN = 0x0;
    CM4LWARN = 0x0;
    
    //Reference clock selection status fail
    //CLKFAIL
    
    //Clock generator selection status fail
    //SCSFAIL
    
    //Oscillator configuration register
    //unlock sequence to be performed before modifying this register
    //OSCCFG
    
    //Oscillator control register
    //OSCCTRL
}